export default function Weather({temperature = 20}) {
  
  return (
    <>
      <h2>
        Створіть компонент "Погода", який приймає пропс "temperature"
        (температура). За умови, що температура більше 20 градусів, виведіть "На
        вулиці тепло", інакше виведіть "На вулиці прохолодно".
      </h2>



{/* if(temperature >= 20) {
    console.log("На вулиці тепло");
    
} else {
    console.log("На вулиці прохолодно");
    
} */}
      {temperature >= 20 ? (
        <p>"На
        вулиці тепло"</p>
      ):
      (
        <p>"На вулиці прохолодно"</p>
      )
      }
    </>
  );
}
