
// обробник події на форму має містити функцію яка відповідаж за знаходження елементів:
// - знайти значення інпута та врахувати кейс. Всі літери автоматично трансформувати в малі
// якщо дані знайдені... виводимо картки або помилку
// фунеція для відображення даних в якій буде розмітка
// функція для виводу помилок


// вивід помилок -> Стас
// функція з розміткою - Едвард + Ваня
// подія при сабміті форми + знаходження значення інпуту - Назар + Олег
// ...
// getDataApi(name) доробити функцію

